[
  {"webid":"wpwa","name":"Progressive Web Applications","price":5,"description":"Progressive Web Apps are web apps that use emerging web browser APIs and features along with traditional progressive enhancement strategy to bring a native app-like user experience to cross-platform web applications.","image":"../assets/images/w6.png"},
  {"webid":"waib","name":"Artificial intelligence (AI) and bots","price":5,"description":"Artificial Intelligence (AI) is a simulation of human intelligence. AI is the area of computer science that focuses on creating intelligent machines that work and “think” as people. AI-powered chatbots understand free language, but also have a predefined flow to make sure they solve user's problem","image":"../assets/images/w3.png"},
  {"webid":"wsa","name":"Serverless architecture","price":2,"description":"A serverless architecture is a way to build and run applications and services without having to manage infrastructure.","image":"../assets/images/w7.png"},
  {"webid":"wmui","name":" Motion UI","price":1,"description":" Motion UI is an open-source Sass library for creating custom CSS transitions and animations.","image":"../assets/images/w1.png"},
  {"webid":"wspa","name":" Single-page applications","price":4,"description":"A single-page application is an app that doesn’t need to reload the page during its use and works within a browser.","image":"../assets/images/w2.png"},
  {"webid":"wbct","name":"Blockchain Technology","price":5,"description":"Blockchain is a system of recording information in a way that makes it difficult or impossible to change, hack, or cheat the system.","image":"../assets/images/w4.png"},
  {"webid":"wiot","name":"Internet of Things","price":3,"description":"The internet of things, or IoT, is a system of interrelated computing devices, mechanical and digital machines, objects, animals or people that are provided with unique identifiers (UIDs) and the ability to transfer data over a network without requiring human-to-human or human-to-computer interaction.","image":"../assets/images/w5.png"}]
